# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, 
# причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. 
# Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число 
# ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит 
# из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь 
# непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один 
# заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.
n = int(input('Введите количество кустов черники на грядке: '))
a = []
summ = []
a. append(int(input('Ягод на первом кусте: ')))
for i in range(n-1):
    a.append(int(input(f'Ягод на {i+2} кусте: ')))
print(f'{a} - Количество ягоды на каждом кусте')
summ.append((a[-1] + a[0] + a[1]))
for j in range(1, n - 1):
    summ.append((a[j-1] + a[j]+ a[j+1]))
summ.append(a[-2] + a[-1] + a[0])
print(f'{summ} - количество ягоды с куста и 2 соседних с ним')
max = max(summ)
print(f'Максимальное количество ягоды :{max}, если собрать с куста номер {summ.index(max) + 1} и двух соседних с ним')
